source/_static/diagrams/25-catalog-and-objects.d2
direction: right
n0: "stratum-0"
n1: "stratum-1"
n2: "catalog"
n3: "object chunks"
n4: "client"
n0 -> n1
n2 -> n4
n1 -> n3
